BookingApp/test/TestCase8/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:book="http://bookingservice.ws">
  <soapenv:Body>
    <book:GetHotels>
      <city>Copenhagen</city>
      <arrival>20016-01-01</arrival>
      <departure>2016-01-30</departure>
    </book:GetHotels>
  </soapenv:Body>
</soapenv:Envelope>