BookingApp/test/TestCase6/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:book="http://bookingservice.ws">
  <soapenv:Body>
    <book:CreateItinerary>
      <itineraryId>26</itineraryId>
    </book:CreateItinerary>
  </soapenv:Body>
</soapenv:Envelope>